select * from trainer_detail order by id desc;

truncate table trainer_detail restart identity cascade;


INSERT INTO trainer_detail (id,gym_co_num,gym_code,trainer_name,trainer_intro,trainer_photo_url,pt1time_price,pt10time_price,pt30time_price,yoga1time_price,yoga10time_price,yoga30time_price,pilates1time_price,pilates10time_price,pilates30time_price)
VALUES
(1,'2021-11-22-01','2021-11-22-01','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(2,'2021-11-22-02','2021-11-22-02','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(3,'2021-11-22-03','2021-11-22-03','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(4,'2021-11-22-04','2021-11-22-04','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(5,'2021-11-22-05','2021-11-22-05','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(6,'2021-11-22-06','2021-11-22-06','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(7,'2021-11-22-07','2021-11-22-07','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(8,'2021-11-22-08','2021-11-22-08','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(9,'2021-11-22-09','2021-11-22-09','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(10,'2021-11-22-10','2021-11-22-10','박봄','근력운동 위주','https://d1m5k1n0yduo9q.cloudfront.net/trainer1.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(11,'2021-11-22-01','2021-11-22-01','김여름','필라테스 경력 10년','https://d1m5k1n0yduo9q.cloudfront.net/trainer2.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(12,'2021-11-22-02','2021-11-22-02','김여름','필라테스 경력 10년','https://d1m5k1n0yduo9q.cloudfront.net/trainer2.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(13,'2021-11-22-03','2021-11-22-03','김여름','필라테스 경력 10년','https://d1m5k1n0yduo9q.cloudfront.net/trainer2.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(14,'2021-11-22-04','2021-11-22-04','김여름','필라테스 경력 10년','https://d1m5k1n0yduo9q.cloudfront.net/trainer2.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(15,'2021-11-22-05','2021-11-22-05','이가을','식단조절 및 개인PT진행','https://d1m5k1n0yduo9q.cloudfront.net/trainer3.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(16,'2021-11-22-06','2021-11-22-06','이가을','식단조절 및 개인PT진행','https://d1m5k1n0yduo9q.cloudfront.net/trainer3.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(17,'2021-11-22-07','2021-11-22-07','이가을','식단조절 및 개인PT진행','https://d1m5k1n0yduo9q.cloudfront.net/trainer3.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(18,'2021-11-22-08','2021-11-22-08','이가을','식단조절 및 개인PT진행','https://d1m5k1n0yduo9q.cloudfront.net/trainer3.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(19,'2021-11-22-09','2021-11-22-09','장겨울','PT코치 경력 20년 이상','https://d1m5k1n0yduo9q.cloudfront.net/trainer4.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000'),	
(20,'2021-11-22-10','2021-11-22-10','장겨울','PT코치 경력 20년 이상','https://d1m5k1n0yduo9q.cloudfront.net/trainer4.jpg','10000','20000','30000','40000','50000','60000','70000','80000','90000');
