delete from gym_detail where id between 11 and 11;

select * from gym_detail order by id desc;
truncate table gym_detail restart identity cascade;

INSERT INTO gym_detail(id,gym_name,gym_co_num,gym_locate_si,gym_locate_gun_gu,gym_address,gym_phone_num,gym_time,gym_service,gym_photo,file_name,file_type,gym1day_price,gym3day_price,gym7day_price,gym_month_price,gym3month_price,gym6month_price,gym_year_price)
values
(1,'강남 화이트짐','2021-11-22-01','서울시','강남구','서울특별시 강남구 도곡로3길 19, 서희스타힐스 지하1층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/1.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(2,'논현 REGENT 프라이빗짐','2021-11-22-02','서울시','강남구','서울특별시 강남구 논현로119길 23, 준미빌딩 B1 리젠트프라이빗짐','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/2.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(3,'대치 로그짐','2021-11-22-03','서울시','강남구','서울특별시 강남구 삼성로 317, 우석빌딩 지하2 로그짐 대치점','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/3.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(4,'대치 휘트니스G','2021-11-22-04','서울시','강남구','서울 강남구 역삼로 542 신사에스엔지 지하 1층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/4.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(5,'선릉 바디스페이스','2021-11-22-05','서울시','강남구','서울특별시 강남구 테헤란로 311 지하1층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/5.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(6,'선릉 보리스짐','2021-11-22-06','서울시','강남구','서울특별시 강남구 선릉로94길 7 현죽빌딩 지하 1층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/6.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(7,'압구정 로그짐','2021-11-22-07','서울시','강남구','서울특별시 강남구 압구정로28길 40, 5층 로그짐','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/7.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(8,'언주 아트짐 토탈휘트니스','2021-11-22-08','서울시','강남구','서울특별시 강남구 논현로 626, 엠빌딩 지하2층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/8.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(9,'역삼 F&G휘트니스','2021-11-22-09','서울시','강남구','서울특별시 강남구 테헤란로25길 7 창성재단빌딩 지하 1, 2층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/9.jpg','','','10000','20000','30000','40000','50000','60000','70000'),
(10,'청담 리발란스K','2021-11-22-10','서울시','강남구','서울특별시 강남구 학동로97길 20 튼튼병원 별관 지하1층','010-1234-5678','[평 일] 06:00 ~ 21:30 
 [토요일] 08:00 ~ 18:00 
 [휴관일] 공휴일','','https://d1m5k1n0yduo9q.cloudfront.net/10.jpg','','','10000','20000','30000','40000','50000','60000','70000');