create schema gagym;
set schema 'gagym';

truncate table gymDetail restart identity cascade;
select * from gymDetail order by id desc;

DROP TABLE IF EXISTS gymDetail;

CREATE TABLE gymDetail (
		id int4 NOT NULL,
		gym_name varchar(255) NULL,
		gym_co_num varchar(255) NULL,
		gym_locate_si varchar(255) NULL,
		gym_locate_gun_gu varchar(255) NULL,
		gym_address varchar(255) NULL,
		gym_phone_num varchar(255) NULL,
		gym_time varchar(255) NULL,
		gym_service varchar(255) NULL,
		gym1day_price varchar(255) NULL,
		gym3day_price varchar(255) NULL,
		gym7day_price varchar(255) NULL,
		gym_month_price varchar(255) NULL,
		gym3month_price varchar(255) NULL,
		gym6month_price varchar(255) NULL,
		gym_year_price varchar(255) NULL
		--	CONSTRAINT list_pkey PRIMARY KEY (id)
		);

INSERT INTO gymDetail(id,
gym_name,
gym_co_num,
gym_locate_si,
gym_locate_gun_gu,
gym_address,
gym_phone_num,
gym_time,
gym_service,
gym1day_price,
gym3day_price,
gym7day_price,
gym_month_price,
gym3month_price,
gym6month_price,
gym_year_price) VALUES(1,'강남 화이트짐','/gymimg/1 (1).jpg','서울특별시 강남구 도곡로3길 19, 서희스타힐스 지하1층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)10,000원','(더미)10,000원','(더미)10,000원','(더미)10,000원','(더미)10,000원','(더미)10,000원','(더미)10,000원'),(2,'논현 REGENT 프라이빗짐','/gymimg/2 (1).jpg','서울특별시 강남구 논현로119길 23, 준미빌딩 B1 리젠트프라이빗짐','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)20,000원','(더미)20,000원','(더미)20,000원','(더미)20,000원','(더미)20,000원','(더미)20,000원','(더미)20,000원'),(3,'대치 로그짐','/gymimg/3 (1).jpg','서울특별시 강남구 삼성로 317, 우석빌딩 지하2 로그짐 대치점','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)30,000원','(더미)30,000원','(더미)30,000원','(더미)30,000원','(더미)30,000원','(더미)30,000원','(더미)30,000원'),(4,'대치 휘트니스G','/gymimg/4 (1).jpg','서울 강남구 역삼로 542 신사에스엔지 지하 1층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)40,000원','(더미)40,000원','(더미)40,000원','(더미)40,000원','(더미)40,000원','(더미)40,000원','(더미)40,000원'),(5,'선릉 바디스페이스','/gymimg/5 (1).jpg','서울특별시 강남구 테헤란로 311 지하1층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)50,000원','(더미)50,000원','(더미)50,000원','(더미)50,000원','(더미)50,000원','(더미)50,000원','(더미)50,000원'),(6,'선릉 보리스짐','/gymimg/6 (1).jpg','서울특별시 강남구 선릉로94길 7 현죽빌딩 지하 1층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)60,000원','(더미)60,000원','(더미)60,000원','(더미)60,000원','(더미)60,000원','(더미)60,000원','(더미)60,000원'),(7,'압구정 로그짐','/gymimg/7 (1).jpg','서울특별시 강남구 압구정로28길 40, 5층 로그짐','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)70,000원','(더미)70,000원','(더미)70,000원','(더미)70,000원','(더미)70,000원','(더미)70,000원','(더미)70,000원'),(8,'언주 아트짐 토탈휘트니스','/gymimg/8 (1).jpg','서울특별시 강남구 논현로 626, 엠빌딩 지하2층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)80,000원','(더미)80,000원','(더미)80,000원','(더미)80,000원','(더미)80,000원','(더미)80,000원','(더미)80,000원'),(9,'역삼 F&G휘트니스','/gymimg/9 (1).jpg','서울특별시 강남구 테헤란로25길 7 창성재단빌딩 지하 1, 2층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)90,000원','(더미)90,000원','(더미)90,000원','(더미)90,000원','(더미)90,000원','(더미)90,000원','(더미)90,000원'),(10,'청담 리발란스K','/gymimg/10 (1).jpg','서울특별시 강남구 학동로97길 20 튼튼병원 별관 지하1층','','','','[운영시간]
[평 일] 06:00 ~ 21:30
[토요일] 08:00 ~ 18:00
[휴관일] 공휴일','(더미)service1','(더미)100,000원','(더미)100,000원','(더미)100,000원','(더미)100,000원','(더미)100,000원','(더미)100,000원','(더미)100,000원');